#include <iostream>
using namespace std;
void main()
{
	/*一位数组*/
	int a[2]={1,2};
	int *p=a;
	cout<<"指向一维数组元素的指针:"<<endl;
	cout<<a<<" "<<a+1<<" "<<p<<" "<<p+1<<endl;

	int (*p2)[2]=&a;
	cout<<endl<<"指向一维数组的指针:"<<endl;
	cout<<p2<<" "<<p2+1<<" "<<*(*p2)<<" "<<*(*p2+1)<<endl;//*p2等价于a

	int *p3=(int*)(&a);
	cout<<endl<<"类型强制转换为指向一维数组元素的指针:"<<endl<<p3<<" "<<p3+1<<endl;

	/*二维数组*/
	int b[2][3]={1,2,3,4,5,6};
	cout<<endl<<"二维数组的元素表示:"<<endl;
	cout<<b[0]<<" "<<b[1]<<endl;
	cout<<b[0][0]<<" "<<b[0][1]<<" "<<b[0][2]<<" "<<b[1][0]<<" "<<b[1][1]<<" "<<b[1][2]<<endl;
	cout<<b<<" "<<b+1<<endl;
	cout<<*(*(b))<<" "<<*(*(b))+1<<" "<<*(*(b))+2<<" "<<*(*(b+1))<<" "<<*(*(b+1))+1<<" "<<*(*(b+1))+2<<" "<<endl;

	int (*q)[3]=b;
	cout<<endl<<"指向一维数组的指针:"<<endl<<q<<" "<<q+1<<endl;
	cout<<*(*(q))<<" "<<*(*(q))+1<<" "<<*(*(q))+2<<" "<<*(*(q+1))<<" "<<*(*(q+1))+1<<" "<<*(*(q+1))+2<<" "<<endl;

	int (*q1)[2][3]=&b;
	cout<<endl<<"指向二维数组的指针:"<<endl<<q1<<" "<<q1+1<<endl;
	cout<<*(*(q1))<<" "<<*(*(q1)+1)<<endl;//*q1等价于b
	cout<<*(*(*(q1)))<<" "<<*(*(*(q1)))+1<<" "<<*(*(*(q1)))+2<<" "<<*(*(*(q1)+1))<<" "<<*(*(*(q1)+1))+1<<" "<<*(*(*(q1)+1))+2<<endl;
}

/*
指向一维数组元素的指针:
0032FA90 0032FA94 0032FA90 0032FA94

指向一维数组的指针:
0032FA90 0032FA98 1 2

类型强制转换为指向一维数组元素的指针:
0032FA90 0032FA94

二维数组的元素表示:
0032FA4C 0032FA58
	1 2 3 4 5 6
	0032FA4C 0032FA58
	1 2 3 4 5 6

指向一维数组的指针:
0032FA4C 0032FA58
	1 2 3 4 5 6

指向二维数组的指针:
0032FA4C 0032FA64
	0032FA4C 0032FA58
	1 2 3 4 5 6
	请按任意键继续. . .*/
